[
    "Continental Hospitals stands out as one of the best hospitals in Hyderabad, distinguished by its commitment to adhering to national and international guidelines while offering an extraordinary aesthetic ambience and safe design. Our …",
    "We are glad we came here. Dr. Kavitha Naragoni ma'am is very patient and kind with our concerns and she assured us with quick  healing and recovery. With the first consultation itself, we thought she is the one to trust with my health …",
    "Very good hospital with very good service and cooperative staff with all modern facilities and star hotel like facilities",
    "During an emergency situation for my mother i approached Continental hospital , They helped immediately and admitted her in emergency. Regrading services\nI want to rate in a scale of 1 to 10 …",
    "My wife was admitted under Dr Ganesh for her Gallbladder stone surgery. The surgery was successful and she is doing well now. The hospital staffs and Doctors are very professional and helpful. Overall the process was extremely smooth.",
    "Experience at Continental Hospital with Dr. Amar Raghu\n\nI recently visited Continental Hospital for my daughters' medical needs and …",
    "I have been here for 3days stay for my mother health issue.\n1. I wonder how this people maintane such a great ambience and comfortness to the patient as well as attendees. take a bow 😇 …",
    "I came from North East (Dhanbad) in Continental Hospital for treatment. Here all the services are very good.. I recommend all to come to Continental hospital and take services . You will be also satisfied like me.. I am satisfied with consultant and services.. Operations Staffs are also very good.",
    "Most of the doctors are really good and professional, happy with the primary medical fraternity (doctors, house keeping and nurses). Dr. Rahul Konduri, Dr. Shilpa Aralikar, Dr. Banda Ravi Teja are amazing! They are very compassionate and …",
    "Today underwent a full body health check at Continental Hospital and wanted to share my overall experience:\nStaff Behavior:** The staff at Continental Hospital demonstrated exceptional …",
    "I got here for my health checkup and my overall experience has been great. Very well trained staff and I was able get my check up done in minimal waiting. Great to be here and i recommended everyone to get their health check up from continental.",
    "Very satisfying.Doctors are approachable,  the assistant doctors are also very good and clarified all our our queries with lots of patience.The experience during the consultation is also very comfortable. …",
    "Very professional team\nGreat location\nGood infrastructure …",
    "Thank you Continental hospital for providing quality services at reasonable price. Special thanks to Rahul Konduri, Dr Dhananjaya Kappadi Lingappareddy and there are many other doctors too. Doctors like you are super heroes. Thanks a lot. …",
    "Dr Ashok Kumar singh ent has been very patient and explained us about his health and My son got his Adenotonsillectomy and tonsillectomy procedure done here in continental hospital 4th floor . It was a smooth experience.",
    "Have visited Dr. Ashok Kumar Singh for nasal issue for my 11 year old daughter Shebah. He is the best Doctor He is very gentle, has treated her for Adenoidectomy with care and patience. My kid is also very happy with doctor and the treatment. Thank you Sir",
    "Good place and very good treatment from Chakradhar Reddy sir. Thank you sir.\n\nDr chakradhar reddy One of the best doctors in Hyderabad for ortho surgery very …",
    "Hello, I want through this health check at Continental Hospital, and I'm very much satisfied with the services. The staff and receptionist everyone are so welcoming and helping. Will recommend it to you guys !!",
    "This is the third time i am visiting the hospitals with three different patients., my mother,. My aunt and my father., all of them happened to visit three different specialities...derma problem of my mother which she has been suffering …",
    "I got the treatment for Dengue. Overall the experience was very good. Dr. Yousef Ali treated me quite well. The nurses and Housekeeping and Hospital management gave very good experience and they were present 24*7 for any need. I would recommend Continental Hospital.",
    "It was a wonderful experience with Dr Neethi Mala ma’am. The motivation, care and compassion she showed through my child birth was impeccable. She’s the best doctor you’ll find in all of Hyd. Every minute was monitored by her and motivated …",
    "Dr.Ravi teja SIR  treated very  good   and treatment has gone very smooth. Staff very supported and the floor Manager PRAVEEN treated and cordinate and GRE JAYASRI  approached very politely is excellent confidence for my life.If u any body health issues plz contact CONTINENTAL HOSPITAL.  is my best suggestion....,,🤓🤓🤓🤓🤓🤓🤓🤓🤓 …",
    "I came from Tripura for PTCA .. Nice hospital all staffs are very good.\nDr. Raghu N Reddy is Director of Continental hospital..He is very kind and used to visit everyday in my room.. I was admitted in 5th floor IPD , here all staffs …",
    "5 th floor mrs T. Krishna kumari admitted in 513 room for TKR with doctor Sudhakar reddy. Services are very very good . Sisters Anila, Vidya , Pratibha, operations vipula, kushmitha , ashitha sisters are supported very well. And all other …",
    "Hispital is excellent. I am continuously utilising hospital services since 10 years and found satisfactory in all aspects like services of Doctors and staff including nursing and others  etc., Dr gouthm is friendly nature with patients",
    "This hospital service, staff cooperation and their way of approaching people and taking care of patients was good. We had visited Dr. Abhishek Mohanty, his way of treating patient and visitors was really good, also the technical dept response also good.",
    "The service in this hospital is too good.\nI have visited this hospital for gynaecologist and Dr. Sunitha kumari was an excellent gynaecologist and her treatment was excellent. And pediatrician was Dr. …",
    "Dr.Nalini treatment is very good, have recovered completely. Good service provided by nursing and house keeping staff of 6th economy. Would recommend this hospital. …",
    "Dr. Sudhakar treatment was great. 5th ipd nursing sister Miss. Ashita service was excellent and polite in her approach and treated us like family. Also, housekeeping services were good. Overall an amazing experience.",
    "I had been in continental hospital recently for Dental care and consulted Dr.Aparajita Gangrade.She is highly committed to her profession and at the same time human too. …",
    "My father was admitted in 4th floor ipd under Dr.Dhiraj Agarwal he treated my patient well ,Now my father is improving much , In this floor nursing is also good they take care patients well\nSo Thankyou continental hospitals & team",
    "After several consultations in many hospitals we came here. Kavitha mam has given trust and confidence for us. After surgery I feel relieved. Thank you Kavita mam for the support.",
    "I came to usg today, the radiologist Dr shushma ma'am done she is friendly and highly talented, I like her and suggest to other to go with her for any type of evaluation.",
    "We visited the hospital for my father’s surgery, and the facility was upto the mark for the entire procedure. Dr. Ganesh Gorthi and Dr. Vasu were very helpful and guided us in the best possible way through the entire process. Hospital facilities were top notch.",
    "I came to Continental Hospital for my Knee check up this morning , I had an excellent experience at Continental Hospital when I lost my huge valuable wallet credit cards and cash in it . The staff went above and beyond to locate it and …",
    "We taking treatment with Dr Sunita (gyno) maam and she is very friendly and understanding and know what exactly issue is. We feel so comfortable with her treatment she is very great in persons understandable I strongly recommend her.",
    "Dr. Arun Reddy treated us very well. Excellent Dr. 5th ipd nursing and housekeeping staff services are excellent. Dr. Assistant Miss. Himabindu was very cooperative. Overall experience has been wonderful. Would strongly recommend this hospital.",
    "We will be ever thankful to this hospital and Dr. Raghuram kondala (Gastrologist) I admited my mom for pancreatitis treatment, sir has given us the best treatment she is now recovering, I would also thankful to the assistant doctor Ashok …",
    "This hospital has become worst from worse over period of time.i have  been visiting for more than 2 years now and for variety of services- and have seen the quality of doctors exponentially falling. Today probably is the last time i will …",
    "Went to continental hospital for my mother in law’s surgery. Both Dr. Kavita and Dr. Vishwanath gave the right advice and took great care in treating the problem. The hospital staff and nurses had been very cordial and the services provided were excellent",
    "It was a good experience with Dr Pradeep sir,he had given good treatment to my patient,my patient was admitted in 6th floor economy ward\nGot a good service from every staffs",
    "Dr. Kavitha Naragoni treatment was excellent. Superb services provided by 4th ipd nursing staff, House keeping, food and beverage team. Total experience has been exceptional. A big thank you to Dr. Kavitha ma'am for such an amazing experience by taking very good care of us.",
    "Good service and treatment\n\nRecently I went to this hospital for myself ,The nurses and reception staff were …",
    "Mrs.Sri Laxmi admitted in 5th floor 512 Dr.Chakradhar Reddy operated went very well and explained all the nursing team is very good especially Kusmitha and Priyanka. …",
    "Dr. Sudhakar treatment was very good. 5th ipd nursing staff were quite emphatic and took good care of me. Floor manager Miss. Vipula ftom 5th ipd has been cooperative. Overall experience has been great.",
    "I'm delighted to share my experience with Dr. Ashok Kumar Singh, who recently performed tonsillectomy and adenoids surgery on my son. Right from the beginning, Dr. Ashok Kumar Singh impressed us with his expertise, and genuine concern for …",
    "Me & my daughter admitted in 4th floor ipd under Dr Sudhakar sir,he treated us very well, floor nursing team is also very good & polite,they took a good care of us …",
    "Here I went for health checkup.I get a great feedback.It's a really nice hospital and all the doctor's and nurses are very good and their behaviour is very friendly.",
    "Hospital and it's services are very good and hygiene. We consulted Dr Dushyant g (ENT Surgeon) for adenoids and tonsill surgery and he has done surgery properly with utmost care. Thanks to the doctor and hospital for proper care. Thanks",
    "I was admitted in under Doctor. Dhiraj sir (Gastro), He has given us a very good treatment , as I was admitted in 6th floor economy, got a very good treatment from nursing team & housekeeping also, they had given the best treatment & Dr. …",
    "Good hospital but standards are going down. Continental was always our go-to for any medical emergencies as it is the nearest hospital for Financial District. However, recently the hospital quality has degraded considerably. All the senior …",
    "I have visited Dr. Jagadish kumar (M.D)  for treating cellulitis. He has diagnosed the illness very well and gave right set of treatment course. It’s been 9 months that I am seeing him regularly and my sugar levels are under control. Will  def recommend him. Thank you continental !",
    "I was suffering from submandibular gland stone from past two months I visited reputed hospitals in Hyderabad, most of the senior ENT doctors suggested for removal of gland since the stone size is 1.5cm. I visited Dr Ashok Kumar singh senior …",
    "Dr. Jagadeesh treated us very well. 5th ipd nursing and house keeping staff service and provided by floor manager Miss. Vipula has been great . Overall a good experience.",
    "Very happy with the wrist surgery done by Dr Arun Reddy. The nursing staff at 4th floor IPD was very helpful and they explained everything patiently and in detail. We had special dietary requirements which were taken care of",
    "Me and my family were in travel and got affected by Cough/Fever/Cold after that. Visited Continental for a check up and took appointment with general physician Dr Srinivas Aditya for myself and my wife. He asked for the symptoms orally and …",
    "Great Ambiance and Excellent treatment by doctors. Under one roof umbrella of departments for all categories of patients. I had admitted for abdominal surgery and treated very well. Recommend for all. Great service and overall rating 9/10.",
    "The worst hospital in terms of in-patient. Doctors and their treatment is excellent. …",
    "My father was admitted in economy ward in 6th floor under Nishanth Sinha doctor who is very famous and good expert(specialist) in Pulmonologist. He's well expert bronchoscopy & lungs decease, no one was given proper treatment to my father …",
    "I have been to Continental hospitals for around 2 years and have great experience. Handling of patients, the way the doctors connects with us and assures us on our health really matters. Treatments works great, staffs and assitant doctors …",
    "Service is good and the doctor Sudhakar is very nice person. The way he treats patient is amazing nd the nurse who appointed for the bed no. 1 she also amazing and good service she provided to us. I am thanking to everyone for support to recovery include housekeeping staff.",
    "Hi, My name E Manikya Reddy from Hyderabad. I was suffering from Hernia health issue and we had Consulted Dr. Ganesh Goorthy in Continental Hospital near Nanakramguda. We had a good and detailed information regarding the Hernia Disease and we underwent the surgery and it was successful. Doctor was so friendly with us.",
    "One of friends went there for a checkup. They made it such a big deal, took him for surgery. After the surgery, they said there's still some bacterial infection and gave vaccine for 5 days twice a day. And after that they were like, we have …",
    "My son was admitted in 4th floor ipd under Dr.Ashok sir (ENT) he had done a good surgery,My son is recovering well & I m happy with his service & staffs are also good here",
    "Our son was suffering from tonsils and adenoids for past couple of months. This condition use to cause him to wake up in the middle of the night due to shortness and difficulty in breathing. This condition required a minor surgery and we …",
    "My patient admitted in 6th floor economy under Dr.Bhanu teja sir,he has given good treatment & service\nGot good service from nursing team & housekeeping also,we are satisfied",
    "Dr. Vineeth treated us excellent and counselled us very well. Very elaborative, cooperative, explained things very clearly. Miss Nandhini nursing staff from 5th ipd service was very good. Overall a good experience.",
    "Dr. Arun Reddy treatment was excellent. 5th ipd nursing and House keeping services were very good. Especially from Mr. Narender from House keeping team. Overall experience has been satisfactory.",
    "Dr JAGADEESH  MBBS, MD(OSM) SR CONSULTANT PHYSICIAN DIABETES, ADULT VACCINATION & INFECTIOUS DISEASES SPECIALIST - BEST DOCTOR IN HYDERABAD & SECUNDERABAD DUE TO MY SELF ADMITTED IN HOSPITAL ON 15062015 DUE TO VERY HIGH BLOOD PRESSURE, NOSE …",
    "Dr. Suneetha Kumari, Dr Anusha Reddy and Dr Sindhu who helped my wife during the pregnancy and delivery of my baby and Dr Shravanti Reddy ma'am is truly helped us to teach how to manage baby for new parents.. I am really grateful of all of them..and also 4th IPD nursing staff as well as house keeping staff",
    "The hospital overall management is great and very synchronised process.\nFacilities are good and hospital is well equipped. Operational staff are very polite.",
    "We are referred from Bhasveswara hospital for USG perianal ultrasound and received a best diagnosis from Radiologist Dr Ruju doshi, best doctor explanation thanks to radiology team",
    "Went through full body checkup. Decent service provided by the staff, there is no much waiting, completed all things in short time. Overall good service I felt.",
    "I had a treatment for Gall Bladder stone for my family member in March 2024.The entire process was smooth. Dr Ganesh G, was patient with all our queries and doubts, and explained the process well. The treatment was good and well taken care.",
    "It was a good experience with Dr.sudhakar sir,he treated my patient well given good service ,got a good service from nursing team also fromthis 6th floor economy",
    "I've got my dad's broken knee bone surgery fix done by Dr Arun Reddy Mallu and everything went well. Doctor is very humble on every visit. Thank hour doctor Arun.",
    "Dr. Rizwan Ahmad and Dr.Vijaylaxmi Nayak treatment is very good. Very happy with the service. Great service provided by 4th ipd nursing staff. Overall experience has been top notch.",
    "My patient was admitted in 6th floor economy ward under Dr.vineeth sir ,he has given a good treatment to my patient so good experience with this hospital",
    "Dr Srinivas Aditya physician has treated my grandmother very well and I have admitted her at 6th floor treatment every thing is good and I am satisfied with the diagnosis given from the team.",
    "My dad had an emergency procedure this month - it was very stressful for our family. In hindsight, what helped us calm down was bringing him to Continental Hospitals. We had a great experience from beginning to end - their operations, …",
    "It's a gud and hygiene Hospital\nMy attayya admited under Dr.jagannadham sir... in 6th floor for a small surgery\nTheir treatment was well and gud\nNow she is fn...happy to see her",
    "My patient was admitted in 4th floor ipd under Dr Suneetha ma'am she is really good Doctor & given a good treatment now my patient is getting discharged today I got a good service from this floor",
    "Good service, Good Staff but sometimes feel it's short staffed. Especially housekeeping staff. What beats me is no one is commenting about mosquitoes.. I have visited practically all OPD's, pathology, Radiology.. everywhere in the waiting …",
    "My father undergone a Hernia and Hydrocele surgery. We got admission in General ward, post surgery. The fecility is good. Staff are friendly and caring. Only at night there needs to be increase is house keeping staff for service load to all patients needs",
    "Extremely nice service good experience overall the hospital entire clean and cool best place to consult the doctors my brother admitted in continental hospital good staff and Doctors 3rd ipd staff each and everyone thanks",
    "The hospital environment is good, and the doctor's treatment too. Went there to get my 5 year old son's fracture treated, had to go through a minor k-wire procedure to re-locate the dislocated shoulder. Dr.Arun Reddy did a great job.\nThe food served in the hotel was very good too.",
    "My both Daughter & son admitted in this hospital in 4th floor ipd we got a very good service from this hospital We are happy With Dr.Vedavyas sir he is really very good,got good service from the staffs also.",
    "We have been coming to this hospital from past 6 years.we are happy with service.\nDr.Praveen dadi Reddy is oncologist surgeon. He was very thorough about the …",
    "My father recently had an angiogram at Continental Hospital and the level of care he received was outstanding. Dr. Meeraji Rao and Dr. Sahithi were exceptionally caring and professional. The staff's politeness and attentiveness contributed …",
    "Got Surgery done under Dr. sundhakar and he is explaining everything clearly and neat. nursing staff at Economy Ward are very Helpful and Obedient. overall Services are Good.",
    "Ms Alisha from communication has been so helpful and extremely hospitable\nDietician Ms Aishwarya Raj is an extremely passionate dietician. She took the pain to go through my history thoroughly and so glad to have met her 🙏 …",
    "I got admitted at 6th floor economy for 2 days. Each and every patient care services was provided by bedside by hospital team and management.. i felt like at home thr way I was treated Even though I was all alone for these 2 days. My sincere thanks to the nursing team and every staff members.",
    "Recently visited continental hospital GACHIBOWLI Hyderabad for rheumatologist, dermatologist, opthalmologist and dentist.Hospital is extremely ultra hygienic and very well maintained with well experienced team of doctors and equipped with …",
    "My mother admitted  for s/p B/L wound exploration  Dr sudhakar sir suggests for surgery  for the wound  the surgery went smooth  the nursing staff  and housekeeping  service are good\nThank you",
    "Dr. Suneetha Kumari treatment was very good. 4th ipd nursing and housekeeping services were great. Overall experience has been good.",
    "Hospital is good and we came to meet dr rizvan general physician and dr. haarika yalavarthi diabetes they had given good treatment and suggestions",
    "The services that I receive from Continental Hospital is excellent. Dr. Shilpa Ma'am and the staff are friendly and ensure that I am properly informed about my health and care. I would have no qualms in recommending them to friendly and friends.Loved it",
    "Health check: I underwent executive health checkup at Continental Hospital. It was very good experience compare to other hospital attended last time. Staff is very humble and very cooperative. They guided me at every moment. Doctors are …",
    "Very satisfied with Dr. MK Singh Sir's treatment and care. Very happy with the services provided by 4th IPD nursing staff, house keeping, f and b team. Overall it has been a great experience. Will surely recommend this hospital.",
    "Dr.Elizabeth and Dr. Shravanthi reddy treatment is nice. 4th ipd nursing and house keeping staff services were good. Overall experience is good.",
    "Dr Yousef ali garu treated well admitted in 2nd ipd all nursing staff and housekeeping service are good hospital primiss are neat and clean",
    "Doctors are good. But the admin staff are monsters. I came for kidney stone treatment. I had insurance. I was admitted for one day. The staff forced me to stay an extra day, just so they can make more money from my insurance. The doctors …",
    "My son was admitted in 4th floor under Dr Ved Vyas sir ,he had given a good service, got a good treatment from this floor staffs also",
    "Having recently visited Continetal Hospital, I must say I was thoroughly impressed with the level of care and professionalism exhibited by the staff. From the moment I walked in, I was greeted warmly and made to feel comfortable. The …",
    "I was admitted in 3rd floor under Dr. Dhiraj Agarwal, he treated me very well, very good service i receive from this floor, nursing team is really very good as well as floor manager is also very good & polite\nThanks Dr. Dhiraj sir & team",
    "This place is right at the main road and has a wonderful entry.\n\nParking is available and valet parking is also available but between 8am and 6pm …",
    "I had an open surgery recently at Continental Hospital and I am really grateful to Dr. Anusha Reddy for the proper analysis, treatment and the care provided. Everyone from the hospital staff, nurses of 5th IPD as well as the house keeping …",
    "My patient was admitted in 4th floor under Dr.Rizvan sir,he treated my patient very well\nGot good service from this hospital",
    "Dr. Mukheem treated us well. 4th ipd nursing and house keeping service is good. Overall experience has been nice.",
    "My mother has undergone gall bladder surgery and hernia repair. Dr Satish reddy has treated her, he helped us a lot in treating her. Nurse Raji from 5th IPD has taken very good care of my mother. Overall experience is top notch. I also want …",
    "Me & my father admitted in 3Rd floor ipd under Dr jagadeesh sir 3Rd floor service is really very good, nursing team is very trained,3Rd floor manager he is also very polite & good …",
    "My patient was admitted in 6th floor ipd under Dr.Sundeep sir ,got a really good service,he treated well& my patient is recovering now",
    "Dr Raghuram kondala and Dr. Vishwanath treatment is very good. 5th ipd nursing and house keeping services are good. Overall experience has been good.",
    "I was admitted in 6th floor ipd under Dr\nSushant sir ,he has given a very good treatment to me he is really nice, as the Nursing team also they are very good & staffs are cooperative too Thanks continental hospital & team",
    "All the doctors have we met are very good and professional. All the nursing staff are very cool n helpful. The hospital is very neat n clean with a very good service. The floor manager Vippula Mam 5th IPD is very helpful n humble. The house keeping is also very good.",
    "I was admitted in 6th floor under Dr.Dhiraj Agarwal sir,he had given a good treatment & I am recovering doing good ,So I would like a thanks Dr.Dhiraj sir & team",
    "Dr.Jagannath , Dr. Sunil and Dr. Mahidhar treated us very well. 5th ipd nursing staff services are good. Overall experience has been great.",
    "It was the worst experience with the hospital staff. I went for my husband's dengue treatment. His platelets decreased on the 6th day of dengue to 20 staff members asking about the donor to reserve the platelets with amount 30k for the …",
    "Dear sir/mam,\n\nYour feedback is important to us! We wish to connect with you to understand more … More",
    "I was admitted in Continental Hospitals Nanakramguda recently and underwent a procedure under Dr. Ashok kumar Singh sir who is one of the senior and well experienced doctor. He has taken good care of me throughout just like my family …",
    "Dr. Banu Teja Reddy treated us very well. Good service by 4th ipd nursing and house keeping staff. Overall service is satisfactory.",
    "Very good experience in the hospital. Admitted my son for 4 days to treat severe infection. Very well handled by the entire team of Dr. Ramya Nadipineni, Dr. Harika. Excellent care under nurses Shirisha, Radhika, Amy, Anupama, Pratima, …",
    "It's a good hospital, there doctors, nurse and staff are very friendly. I went there for my health checkup and I received a great feedback.",
    "Worst experience when booked for master health checkup. There is no enough staff and takes one hour for billing and one hour to take blood samples.\nHorrible experience, never recommend. …",
    "Thankful to the esteemed docs (viswanath , Ravikiran, Praveen sir ), nursing and support staff( vinisha and prathima and others) for all their constant help and support in helping me recover from surgery. It was very positive experience since admission till discharge. Great job everyone!!!",
    "My mother got admitted in 6th floor economy under Dr.Chakaradhar sir ,he treated my mother very well I m very happy with his service,also nursing & housekeeping team is also very good & attentive\nThankyou Dr.chakradhar sir & continental hospital",
    "Dr.Ramesh reddy sir treated good  now my mother doing well and hospitality also good we are in 5th ipd the staff was good and the nursing staff and House keeping are also good\nThank you",
    "My friend had the worst experience here. For mere fever they overcharged her with tests in name of insurance claim to a bill. On top of that they didn't attend to her at all. Most rude and negligent staff I've ever seen. Even the patient …",
    "During January, 2024, my wife underwent Robotic assisted surgery for Cholelithiasis (Cholecystectomy) and repair of Umbilical Hernia at Continental Hospital, Hyderabad.  With our previous positive experience, it’s our immediate choice to …",
    "Continental Hospital is one of the best hospital in Hyderabad. I recently undergone for  my medical issues at Continental Hospital and consulted with Dr. Yousef Ali. To be honest i have great experience with treatment I received. Yousef sir …",
    "Dr. Sathish reddy ( general sergen) . He was really friendly nature and terment is good.\nI felt happy to done an surgery with him.",
    "My friend recently had her surgery, we appreciate the doctor and their team. Very Co-operative staff and understands patients problem very well. Very Good hospital and Good service.",
    "Dr. AVS Suresh treatment is very good. 5th IPD nursing staff service is very good’ housekeeping services are good. Overall experience has been great. Will strongly recommend this hospital.",
    "The Doctors at Continental Hospital are good and professional.\nDr.Kranti Kumar, Dr.Chakradhar Reddy, are amazing! They are very compassionate and highly experienced, and the hospital has good medical fraternity. House …",
    "Dr. Sunil Epuri and Dr.Mukeem are the two doctors who are treating me. I am happy with their diagnosis and line of treatment and also for the service in the hospital.",
    "I recently had the misfortune of being involved in an accident, which led to my admission to Continental Hospital, Hyderabad. During this difficult period, I was under the care of Dr. Vineet Sakhireddy, a urologist, and his junior doctor, …",
    "Gastro specialists - Dr. Ravi Kiran and Dr. Lalit Kumar Reddy.\nNursing supervisor - Aslam. …",
    "Doctor swapna and laser techinicien apoorve job with the laser treatment it was very effective and its always reco To do so in this hospital and iam extreamly happy with the treatment..",
    "I'm thrilled to share my complete satisfaction with the amazing care we received at this top-notch hospital. My mom had a tough battle with Cholangiocarcinoma (bile duct cancer), but thanks to the renowned  Dr. P. Jagannath and his team at …",
    "Excellent service provided by Dr. Lalith Kumar, Dr. Vineet, Dr. Gowtham Choudhary. 4th ipd nursing and house keeping services are very good. Will recommend this hospital.",
    "I would like to express my gratitude to Dr. Mallik and his team for the exceptional care my father in law received during his radiotherapy.\nDr. Mallik is very friendly and gives ample time to patients to make them …",
    "One of the best hospitals in Hyderabad without any doubt. Ticks every box in providing the required healthcare solution. Visited Dr. Dhiraj Agrawal for my fatty liver issue. Very satisfied with the treatment and service received. Would definitely recommend this hospital and Dr. Agrawal.",
    "They will make you rate  as 4 or 5 stars. But I changed it to 3 stars as my only reason is the waiting time for OP consultation. I was visiting Dr. Dananjaya for my father's kidney stones and Pradeep kumar Reddy for my mother's anemia. …",
    "I have suffered with food poisoning and Dr. Dhiraj Agarwal treated me very well with intense care. Highly satisfied with the treatment and timely availability of doctors (Dr. Dhiraj Agarwal and Dr. Pranav) and nurse especially Sucharita.",
    "Got admitted at 6th floor economy, I sincerely thank nursing team specially staff nurse Mounika taken care with good effort, attended very patiently, excellent housekeeping staff for quick response..",
    "Continental Hospital, you have my deepest gratitude...\n\nMy dad suffered a massive heart attack on March 27th. From the moment we brought …",
    "I had a collerbone surgery, and the doctors did a very good job and all the support staff was very helpful. Very good facilities as well.\nVery neat and clean hospital as well",
    "The service of Doctors and nurses was good. But the people at billing counter are not good. They cheated with us to increase the expenses. …",
    "I was admitted under Dr Ravi Kiran for abdominal pain, He and his team took good care and coordinated with the IP team very well , the 3rd IPD nursing team was very good in both communication and patient care . special thanks to Dr Dileep, …",
    "From the time I had got admitted in the middle of last month till my discharge earlier in the 1st week of this month, I had received tremendous support from Dr. Senthil Kumar and his team, not to forget the dietician's role and the most …",
    "I came for health check in continental hospital, it was a very good experience i got a good service from Vaishali, Sai & Bhuvana, They cooperated alot, Overall it was a good experience",
    "I did a healthy check today with Continental hospital. The process was seamless and smooth. I did not face delays and instructions to different departments for the check up was easy to follow. The personnel were friendly and helpful. Good experience overall.",
    "It was a good hospital. They will treat you nice. And there service good. Doctor 's were very friendly. U can consult whenever you want .",
    "I took my husband into ER for his Tummy pain.  Dr.Ganesh Gorthi, Dr. Ramesh Reddy, Dr. Vasu, Dr. Meghanath Reddy has been cordial and caring during the surgery and since then available until he got discharged yesterday.  Heartfelt thanks …",
    "From the appointment till to the discharge all facilities like doctors treating with patient and nursing assistants and other working persons all are very good and  especially very thank full to Dr Mukeen sir",
    "I admitted my wife for cervical problem and Dr Randhir kumar suggested surgery must and also given complete false information he said it's a simple surgery and can be discharged in 2 days and after 1 week you can continue daily work but …",
    "Came here to get my health checkup done. The entire process has been very smooth from the beginning to the end with proper guidance by the staff. They have guided me through the entire process and made me feel comfortable the whole time.",
    "If you are going to this hospital either with insurance or without\nThey are going to loot you people\nWhen I was in emergency before joining the hospital they told the ct scan is of …",
    "DR. Dushyanth ENT sir is very humble and he treated the patient very well.\n4th IPD nursing staff services were good!",
    "Dr chakradhar reddy One of the best doctors in Hyderabad for ortho surgery very approachable he is an mrcs and frcs.  He has such huge experience  after  learning about him i had full confidence that i will be cured after the surgery. I had …",
    "The services of 5th IPD nursing staff at Continental were great. They were available at every time and housekeeping and food services were also good.",
    "Dr. Anusha Reddy treatment is very good. Excellent service provided by 4th IPD nursing staff, housekeeping, food and beverage team. Overall it has been a great experience.",
    "Health Check:\nHad my routine healthcheck recently. The staff has been extremely professional to conduct all tests without waste of time in between. Well organised and …",
    "Feeling very relaxed and problem free after a most worried Minor Surgery I have undergone. …",
    "Admitted under Dr meeraji sir treatment is good and nursing staff housekeeping services are also good\nThanks you",
    "Dr. Navin Y. Is a superb ophthalmogist. Very humble, soft spoken and loaded with great clinical experience.\nThe person sitting on reception counter was very irritating and made me stand …",
    "My wife treated under sr Sunitha k mam she is very good doctor nice experience highly recommend this hospital thanks",
    "Dear continental Hospital Family I really appreciate to all the staff of Continental Hospital in India, Hyderabad.\nSpecial thanks to Dr Ajay Reddy, neuro surgery specialist who did succesful …",
    "Getting treatment at continental hospital under Dr sk Gupta sir and Dr Pradeep Kumar Reddy.  Both are awesome doctors and best in oncology.\nHMT department always gives homely atmosphere and care rather that a hospital …",
    "Dr. Aparajita Gangrade is really awesome. I went in with infection in one of my tooth and later for a root canal, and the only way I can sum this up is by saying she is superb professional and a true expertise in her work. she takes the …",
    "I'm here to share my positive experience with Dr. Ashok Kumar Singh, who recently performed sinus surgery on my mom. From the moment we walked into the office, we were greeted with warmth and professionalism by the entire staff. Dr. Ashok …",
    "Dr. Dushyanth's expertise and care during my mother's ENT surgery were exceptional. Their reassuring manner and clear explanation of the procedure put us at ease. We are grateful for the successful outcome and for Dr.Dushyanth's dedication to my mother's health and well-being.",
    "We had Hassel free experience  with hospital. Pre and post surgery care was awesome.\nDr. Ganesh, surgeon is very friendly and made us very comfortable for the treatment.",
    "Excellent service provided by Dr. Sudhakar Reddy. 5th ipd nursing staff and floor manager Miss Vipula service is good and cooperative.",
    "Service provided and behaviour of Sister Vinisha from 4th IPD nursing staff was very good. House keeping service is good. Overall all staff is good. Dr. Sahiti Priya assistant service is very nice. Will recommend this hospital.",
    "Came for health check in continental hospital from Hyatt it was a great experience with the staffs & I m really satisfied with the service, Vaishali helped a lot",
    "I had a very bad experience with Continental Hospital. I was examined by Dr. Satish Reddy for Perinanal Abscess and after tests it was confirmed as Pilonidal Sinus but doctor didn't mentioned anything, he simply said it's same go for a …",
    "I am coming from West Bengal for treatment in Continental Hospital.. All doctors and staffs are cooperating very well. I am very satisfied.. I stayed at 5th floor IPD, here staffs are very good.. We are feeling very happy to see one bengali …",
    "Dear continental Hospital Family I really appreciate to all the staff of Continental Hospital in India, Hyderabad Excellent service from Dr Jagadeesh sir ( General medicine ) highly recommend this hospital. …",
    "I got a good service from 6th floor economy, admitted under Dr.Ravi Kiran sir ,\nHe given a good treatment\nVery happy with continental hospitals",
    "The way they treated patient with kind and generously with lit of patience . specially in radio oncology dept.  Dr APOORVA madam she is brilliant and gem of a kind . I have seen many dctrs but she truly inspires everyone. And staff is …",
    "I have got admitted at 6th floor economy ward for 3 days. The entire staff are nice and cooperative. The doctors are good and always eager to help. Nursing staff Janaki and her team are good and helped me with patience.",
    "Today morning I went to ENT department of this hospital at Road no.1, Financial district with an appointment for the purpose of ear piercing & fixing gold coated studs to my grand daughter( 6 months old baby). I was made to wait almost 4 …",
    "Its was a very good experience with Dr.srinivas Aditya,I was admitted in 6th floor economy, Nursing team is very good & housekeeping also\nThanks continental hospitals",
    "Dr Satish reddy sir is very good at both communication and surgical skills. Sir has given all the advices what I should do.",
    "Dr. kavitha Nargoni and nursing staff treated my mother very well in the ipd 4th floor\nOverall had a good experience with service and hospitality",
    "Dr. Dusyanth treatment is good. 4th ipd nursing staff service is good. Overall experience has been good.",
    "My father went for a surgery here and we consulted Dr. Ganesh Gorthi. He is excellent doctor , expert in laparospcopic surgery, surgery went well. Doctor did thorough investigation before prescribing anything. Scan and tests are done …",
    "The facility was clean and well-maintained. The staff was attentive. The medical professionals explained things clearly, easing any concerns. I would recommend Contintental Hospital for their quality of care and friendly staff",
    "I got admitted under dr sowmiya in 4th IPD Nursing service was good specially sister vinisha taking care of me very nicely.",
    "Everyone here is very helpful and very good. If there is any problem, everyone helps. All over everything is good and the hospital is very neat and clean. Deputy Manager Pooja Dey is very helpful so you can feel free to stop here. The doctors here are also very good",
    "Recently my brother with an accident, we admitted him in continental hospital, Dr.Ganesh goorthi is our consultant doctor and surgery was successful, doctor is very friendly and he treated us well. Hospital ambience and staff is good\nThanks Ganesh and Vasu sir for all the support",
    "Caring toward patient was good like homely nature ,specially gastroenterology doctors were treated well quick recovery within a 15 days ,",
    "Dr jagadeesh sir treated good  admitted in 2nd ipd nursing staff and Housekeeping service are good\nThank you",
    "Excellent services provided by the continental hospital department.\nDr. Ganesh is very helpful and supportive during my examination. Grateful to have him as a specialist.",
    "My patient was admitted in 6th floor economy ward under Dr.Ravi Teja he given a good treatment to my patient",
    "Dr. Arun Reddy treatment was good. 5th ipd nursing and House keeping staff services are good.",
    "My wife admitted in6th floor economy ward under Dr.sudhakar reddy it was a very good experience from this hospital, nursing staffs are very good",
    "Dr. Sudhakar Reddy Sir treatment is very good. 4th ipd nursing care and house keeping staff service is nice. Will recommend this hospital to all. Happy with overall services.",
    "Service is good in 4th floor ipd, My son was admitted under Dr. Sravanthi ma'am\nTreatment is good in this hospital",
    "They are big scammers, they are doing scam with a lot of micro management and fake words and smiles\nTrust me guys they are cheating on us. …",
    "Look at this nonsense quote in the SICU waiting room.5th floor.\nVery inappropriate. Putting this post just for that, this by no means indicates service level at the hospital",
    "I visited dr. Ashok Kumar Singh regarding septoplasty and turbinoplasty. He explained the things very well and whole process from doctor side was good. Had few follow ups and now feeling good.",
    "I have done general health check up today , it was very good experience and they have completed all tests within 3 hrs and very good hospitality.\nFinally I have satisfied with their excellent service.\nThank you very much .",
    "Dr. Elizabeth treatment is very good . 4th ipd nursing staff and housekeeping services are great. Overall experience is satisfactory.",
    "Dr. Sudhakar Reddy treated us good. 4th ipd nursing and housekeeping staff services are good.",
    "Im a doc my self, this hospital is very bad in my opinion, I regret getting my father admitted here, only because my close family friend and doctor directed me to a specialist here. we landed up here …",
    "My patient was admitted in 6th floor economy under Dr.Vineeth ,recieved a good treatment from nursing team of this floor thanks",
    "Admitted for left foot injury due to an accident for my cousin\nDr. AMAR Raghu sir has addressed the concern and guided for an debridment.\n4th opd Nursing staff was helpful and taken good care.",
    "It's really unbelievable experience with continental hospital doctors and medical staff I got admitted on 26th April  I'm 3rd IPD today am going to discharge Past 10days  i got really excellent treatment by the doctors and everything …",
    "The floor staff would benefit from more humility. It would be great to provide them with additional training to improve their customer service.",
    "Good experience with Dr.Rahul sir,I was admitted in 6th economy, Nursing is going & housekeeping also very good, good behaviour\nThankyou continental hospital",
    "Got good service from 6th floor economy ward,under Dr.Praveen Dadi Reddy sir,he is really nice,well treated my patient",
    "Had a health checkup here , co-ordinated with Praveen for the entire procedure. It was smooth and clean , had a a smooth process .",
    "It is very good experience with treatment and doctors satisfactory, we diagnosed with one of the fracture successfully under the DR. CHAKRADHAR REDDY.  &Nursing staff of DIVYA  assisted very well,highly appreciated at 6th floor economy and …",
    "Dr. Banu Teja Reddy, Dr. Shailendar and Dr. AVS Suresh treatment is excellent. 5th ipd nursing staff is very cooperative. Overall experience is very good.",
    "Underwent laproscopic appendectomy through Dr. Ganesh Gorthi and Dr. Dheeraj Gopal Agarwal. The surgery was done very efficiently with appropriate safety measures. I am posting this review after a week of the surgery and there are no …",
    "My Father admitted in Continental Hospital and treatment was Excellent and Care taken by the Doctor Chakradhar Reddy is outstanding, I really recommend Continental Hospitals to my family and friends for any kind of health issues and emergencies and finally we are satisfied with the treatment.",
    "We are under the treatment of Dr Dhananjaya treatment is very good. Best doctor we have ever met,at the hospital service provided by 5th IPD nursing staff, house keeping is excellent.",
    "Its very good hospital and fast recovery\ndr. Abhishek sir well explained and done with process very nice",
    "My kid underwent Tonsillitis and Edinoids operation by ENT doctor Vijaya Lakshmi, she did very well and also follow up the patient after operation also.\nHospital facilities and nursing also taken care well.",
    "It was a good experience with Dr Shilpa ma’am in 6th floor economy,got a good service from nursing & housekeeping’s staffs also",
    "We came to meet a general surgeon, he advised us surgery, we did blood tests and PAC. Service in ZERO, nobody even bothers to guide u, We were kept waiting for 2 hrs PAC and were sent bak home without PAC report. We were told that we wil …",
    "Long story short: Too big staff but there is no proper communication among staff leads to unnecessary delay. Money oriented hospital - they know how they can increase bill and if insurance is there they try to take even more from insurance …",
    "Dear sir/mam,\nThank you for your five-star rating. We appreciate your valuable feedback. … More",
    "We extremely very happy with dr nalini such great doctor inhave never seen like dr nalini treated like a family member and 3rd IPD staff we co operative excellent supportive really thanks to Dr nalini and Dr linu and Mr neelesh all are helped alot thanks to all",
    "Dr Gowtham sir is very good treated me very well,i was admitted in 6th floor got a very satisfied service\nNursing is good",
    "Hi my mom admitted in 525, Dr.kranthi operated to my mom, he is very nice person and nursing services are good especially Athira sister, Priyanka sister, nursing incharge Pratibha sister …",
    "Dr. Arun Reddy is an excellent Dr. Treatment is very good , way of talking is nice. 4th ipd nursing and house keeping staff service  is good. Will recommend this hospital.",
    "Most of the employees sitting at the reception desk are absolute fools..they do not even check if the doctors are available or not in OPD and directly ask the patients to get a registration card created. Then only the patient comes to know that it's of no use since the doctors are unavailable.",
    "I came to this hospital for elbow surgery and met the orthopaedic Dr. Sudhakar Reddy Sir and felt very happy to met him. The team along with Sudhakar Reddy sir taken complete care and did my surgery very well. Feeling good to choose him.",
    "Have been visiting for physiotherapy with Dr Ranjith. It's very helpful. The therapy worked from the very first day. Able to feel better due to the suggested stretching exercises.",
    "I'm came to this hospital for my health check up...IT'S a very friendly hospital...The doctors and the employees are also very good",
    "Dr M.k.sing sir is great doctor and 3 ipd  nursing staff it's a great....Very good hospital with very good service and cooperative staff with all modern facilities and star hotel like facilities",
    "Dr.Yousef Ali treatment is very good. 5th ipd nursing and housekeeping services are great.",
    "Dr.Ashok and his entire staff at the ENT department have been a pleasure. They were extremely helpful with my dad's surgery and post care and would recommend him for anyone looking for a good ENT doctor. …",
    "My father got admitted for stomach upset and vomiting. He was admitted on Tue early morning and discharged on Wed evening 4 pm! With a bill of 80000!!! For Investigations! It's a money looting organisation. Dr Dhiraj Aggarwal the …",
    "Dr.pradeep kumar sir treated good and nursing housekeeping was also good, patient was admitted in 6th floor economy ward",
    "Visited the hospital to see my uncle today. No issues with healthcare, but concerned about the  parking charge during visiting hours. When I inquired, I was told it's contracted parking services; however, according to the law/GO, hospital …",
    "This is the first time visit to this hospital. The hospital is very big one with lot of space to sit. We came here with senior citizens, they noticed and asked us if we need wheel chair assistance. After parked the car in basement the …",
    "My patient was admitted in 6th floor economy under Dr.Abhishek sir ,we got a good treatment",
    "Dr. Jagadeesh treatment is very good. Good guidance provided by Dr and nursing staff, housekeeping, f and B team. Food is good. Overall service is good.",
    "Doctor Kavitha Naragoni treated well and intimated all the information well in advance and intimated the required post treatment options. Doctor is friendly speaking and pay attention to listen the patient carefully and answered all the questions.",
    "My patient was admitted under Dr.Jagannadh sir in 6th floor economy, got a very good service from nursing & housekeeping\nThanks",
    "I had a very good experience in 3rd IPD 304A. Service provided by doctors and nursing staff was exceptional. Special thanks to floor incharge Neelesh for his support and guidance.",
    "We went for treatment under Dr Kavita Nargoni. She ans her team did an excellent job. I was quite impressed with the management (operations) aspects. Everything was streamlined and went smoothly. Nurses were quite experienced.",
    "My mother had a bilateral knee replacement surgery done here. We are very happy with results. Dr Ram Mohan Reddy was very efficient, supportive and patient friendly. The nursing staff was caring and attended all the needs efficiently. Many thanks to nurses Beaula, Anupama and Anna who made our stay comfortable",
    "Good experience with Dr. Sushant sir, he is very good service is also good here in 6th floor economy ward nursing is really good",
    "Myself Priyanka, I went for consultation with Dr Ganesh G for cholecystectomy for gallbladder polyps. I came initially with surgery phobia as I already have clustro phobia. But my surgery process and post operative treatment everything went …",
    "Dr Guru N reddy  sir treated very we'll  and hospitality is extreme level nursing staff and housekeeping presented in time\nThank you.",
    "My father admitted in 2nd ipd Mr.Venkataiah Room no :203A. The service is too good.Especially Nursing services are excellent.Mostly sis .Sravanthi,Bhanu prasanna are too good.They are kind  and gentle with the patient.very polite with everyone in our observation.We will recommend this hospital.Thank you everyone.",
    "My self Naveen, had an ankle fracture. I met Dr. ARUN REDDY MALLI in continental hospitals, explained well about the surgery ORIF OF MEDIAL MALLEOLUS, it went very well and now am doing well with no complaints. I thank Dr. Arun Reddy sir for overall treatment. I suggest him for all orthopedic issues.",
    "Very pleasant service from continental hospitals came for consult of my friend and doctor advised radiology scans.\nUSG and after that they advised for CT, in no time it was done. …",
    "Dear sir/mam,\nWe are so glad to take care of you and your feedback will be shared with our staff and will truly bring millions smiles on their faces.  … More",
    "I was having a very good experience with continental hospitals. Mary from Oncology department is very good. She is very close to us from day one and she is very efficient and caring person who explains everything clearly helping us since …",
    "Dr Malik Singaraju and Dr AVS Suresh treatments are excellent..and hospital staff also good receiving patients..well satisfied..Thank you",
    "My patient was admitted in 4th floor ipd, under Dr.Sudhakar sir, he give a very good treatment to my patient, Nursing team is also good,\nThank you continental hospitals",
    "Hospital is great and we where consulted by Dr.Kranti kumarand other doctors,The response was great.",
    "Overall good experience\nWell maintained hospitals.\nStaff are helpful . Received quick response",
    "Had a really bad experience. I was hospitalized for a day and the charge was around 16k . They asked if we have insurance and asked where do I work. I by mistake ended up saying about my office and they knew about the insurance policy. I …",
    "My son was admitted in 4th floor ipd we got a very good service from Dr.Mukheem sir, & also got a good service from this floor nursing & housekeeping team",
    "It's been located in the heart of the Financial District in Hyderabad. Excellent and prompt service.\nWe have been visiting this hospital for Dr.  Srinivas Prasad Perla. He is the …",
    "Dr. Chakradhar Reddy treatment is very good. 5th ipd nursing staff service is good.",
    "My patient was admitted under Dr.Praceen sir he is really a very good doctor recieved a very good service from 6th floor ipd\nThanks",
    "It was a good experience with Dr. Srinivas sir in 6th floor economy ward got a good service from everyone",
    "I was admitted under dr Jagadeesh,he given a very good service very happy with his service nursing team is also good in 2nd floor",
    "Dr. Sundeep snd Dr. Sudhakar treatment is good l. 4th ipd nursing staff services are good. Good experience.",
    "The surgery was done by Dushan sir he has done very well the surgery the staff and the services are too good and friendly it was a great experience",
    "Dr Suneetha Kumari has helped us in our first pregnancy very much by explaining every stage thoroughly.  The whole crew's dedication in labour room helped in the process of natural delivery. We are thankful to many of them, especially sr. Anupama and Dr Harshita for their support.",
    "I visited the place for treatment of my mother. All doctors and hospitals staffs are very helpful and cooperative. My mothers treatment going very nicely. Thanks to the team of Continental Hospital.",
    "It was a great experience with Dr.Arun sir ,he treated me well,I was admitted in 6th floor economy,got a good service from that floor\nThankyou",
    "Dr. Mukheem treatment is good. Great service provided by nursing and House keeping staff of 6th economy. Overall experience is satisfactory.",
    "Patient was admitted in 6th floor premium economy. Dr.Rahul Konduri and Dr.Mounika have been really helpful. The support staff is efficient. The facilities are good.",
    "Dr. Satish reddy treated my father-in-law. He is an exceptional doctor with top notch care provided. Unlike other he has taken care of the patient and discharge in one day.",
    "Very commercial place. Just money minting hospital in prime vicinity and least bothered about patients. They do even charge for parking in today's world where even malls don't charge for parking. Instead of patients people roam around for …",
    "My father had a brain stroke and we took him to Continental hospital Nanakramguda for emergency treatment. Ever since he was under care of expert neurologist Dr. Chakradhar Reddy who did a fine job of handling the delicate scenario and …",
    "My experience in Continental Hospital is just amazing. Treatment of Dr. Guru N Reddy is great and I do recommend.im from Nigeria.",
    "Dr. Raghuram treatment is very good. 5th ipd nursing and housekeeping staff services are good.",
    "Dr. Satish Reddy has done hernia operation for my mother. He was so professional & friendly, hence we did not prefer a second opinion as he had clearly explained the symptoms and the implication of the surgery in a quite understandable way. …",
    "Very happy with services of continental hospital and Dr.Bhanu teja also guided us in 3rd IPD and the other duty doctors and nurses helped in every aspect and floor coordinator l. A special thanks to the entire team.",
    "Treatment by Ravi kumar doctor is very good. Highly suggested for gastroenterology concerns.",
    "I highly recommend Dr Vidhyalatha Atluri for anyone seeking compassionate and knowledgeable fertility guidance. The doctor's expertise, clear communication, and personalized approach made my journey toward conceiving much smoother, the support and care provided by the entire team were exceptional. Thank you Mam.",
    "My father got admitted in continental hospital under Dr Ramesh reddy Gastro in 3rd IPD it's an excellent treatment and excellent service we received from the Dr side and Sister and duty doctors floor manager Mr Neelesh supported very well thanks to all continental management and doctors and sisters.....",
    "Good morning all .my father came for chemotherapy under Dr pradeep k reddy under admitted. When we went to chemo department. My father had done for 4cycles ,I was so happy and satisfied the work of Doctor and staff nurses in chemotherapy …",
    "Admitted in 6th floor under Dr. Amar raghu sir, services is good, nursing is also good\nThank you doctor & continental hospitals",
    "Dr. Arun Reddy treatment is good. 4th ipd nursing staff service is good.",
    "Manojkimar.                                                      This hospital has a welcoming atmosphere, the nursing  staff  are attentive to thé écho ans the doctors are available. In fact the services are very good, good city, high technologie, goog meal.",
    "Doctor is having very well behaviour and treatment is very nice. 6 th economy nursing staffs are on time service and well trained staffs",
    "Dr.Amar Raghu treated me for my epidermal inclusion cyst. The whole treatment experience was top notch and the hospital staff were friendly.",
    "I consulted with doctor Ashok for my throat infection. The doctor was very considerate and listen to all my problems and gave his feedback.I was prescribed medication that was helpful in getting rid of the infection in less than a week.",
    "I booked a Health checkup it was quick and seamless process. Staff is really helpful in guiding throughout the process.",
    "Very good caring this hospital   Dr Chakradhar sir very careful to my mother\ncoming to hospital very suffering from paralysis to my mother  but now she is a very active and she is walk without support I will thanks to Chakradhar sir and this hospital management thank you so much sir",
    "Nursing  services are  amazing , housekeeping  staff is so soft speaking ppl, doctors  are so concerned towards patient ..overall continental hospital is best among all hospitals in hyderabad  thank u",
    "Avs suresh oncology department,  asper my experience treatment Is good, but  cost is high.",
    "One of the excellent hospital in Hyderabad. I was taking consultation with Dr. Raghu (gastro), then Dr. Rama Krishnudu (cardio) and Dr Banu Teja Reddy (urology). The doctors treat patients as their VIPs and made me more comfortable and said …",
    "Worst fellows in the MRI scanning department. One young girl of 20 yrs went for an MRI scan and the hospital staff, including floor cleaners were taking the video of this girl scanned private parts in MRI control room and the parents were …",
    "Dear sir/mam,\n\nYour feedback is important to us! We wish to connect with you to understand more … More",
    "My father is admitted in this hospital. I have consulted by Dr lalith reddy. He gave me his best service to my father.",
    "We are happy with Dr Ganesh.G surgical gastroenterolist. Sir explained  patiently about gallbladder issues. Thank you Continental Hospital Team.",
    "Face sinus Track issue...\nDheeraj Sir explained entire process and he suggested for surgery\nNext day surgery went very well and doing good now..... …",
    "It is on if the best hospital for healing lives I would consider here for best pulmonology and endocrinology . Staff and crew are good in apporach",
    "My father got admitted at economy 6th floor, Services of nursing team, housekeeping and all staff is excellent,great co operation,hassel free services,doctors are very helpful,Good patient care services..Thanks",
    "My mother got admitted in continental hospital in 3rd ipd  under dr CVN Murthy sir the hospital entire service is the best never visited before but this is my first visit because of my mother if anything need definitely inwill recommend …",
    "I was admitted under Dr Abhishek Mohanty, he took good care of me, both ICU and 3rd IPD team are very good\nSpecial thanks to Sushma, Jyothi, Raji, Jisni, Neelesh, Dr Dileep, Dr Narasimha for making our stay good",
    "Admitted under Dr Ramesh Reddy sir treatment was good Housekeeping and nursing service also good.\nThank you",
    "Dr suhant sir treated well good service by the nursing's team and housekeeping 6th floor economy ward",
    "We have a wonderful support from Dr. Mukheem and dianosed well and from Nursing staff Raji and Sunitha 5th IPD.",
    "Good hospital\nExcellent Doctors\nNice nursing staff …",
    "The patient is admited in 6th floor under Dr Rama krishnendu sir Nursing team is very good service is good",
    "Dr .Shravanti Reddy's treatment is very good. 4th ipd nursing staff very good service and friendly environment. Will surely recommend this hospital.",
    "Dr.Jagadeesh took care of the patient well.Hospitality of the staff and Care taken by the Nurses is commendable on 6th Floor.",
    "The dental section has a pathetic treatment.\nThe senior Dr for teeth extraction a very rude behaviour and was in a rush for the treatment. …",
    "I have got admitted at 6th floor economy,  under Dr Mukheem neurophysician ,Nurses paid very good attention and took good care of patients. 24/7 availability of nurses,Good treatment,Am truely fortunate to be under your care,Hassle free services..Thank you continental hospitals 🙂 …",
    "I would like to share my surgery experience with Dr Ashok Kumar Singh ENT at continental hospital. My condition was well diagnosed by the doctor and surgery suggested. Doctor did the surgery very well and professionally. The experience with …",
    "My experience with hospital  was very good, housekeeping staff anju was especially  very good ,even nursing staff 5th ipd is very  good  .overall  it was a good experience  .",
    "I was completely satisfied with how Dr.Ruju Doshi, Radiologist, guided and treated me during my treatment. I must say that she’s one of the best doctors that I’ve come across.",
    "My father got admitted under Dr  Laxminadh Shivraju  sir the operation diagnosis cp angel cpiclermoil cramolaning excision brain  tumer we have been  refer form Kammareddy specially to Dr.laxminadh sir .My father is alright now he is going …",
    "Recently my kid, who is 8 yrs old was admitted. Suffering with acute diarrhea. Thanks to all d team of doctors n nurses, who took very good care of her. I'm so thankful to Dr. Kiran kumar sir and Vijay sir, who have given her apt treatment …",
    "I was admitted in 3rd ipd with abdominal pain and the care taken by the consultant doctor and nursing staffs were amazing .I am very thankful to all the staffs and duty doctors and Floor co ordinator Helped alot each everyone",
    "We got admitted under Dr Arun reddy mallu for my left Clavicle facture everything is fine with service from the Dr side and 3rd ipd the was very good nice sisters and duty doctos foor manager everyone is helped alot thanks to continental hospital staff and doctos",
    "My husband got admitted at 6th floor economy, I really appreciate the services of all staff, nursing services are excellent, cleanliness well maintained,F&B services are extremely good,Dr Sowmya has given very supportive care and helped in healing soon..Thank you continental hospitals,I refer for good patient care.",
    "Best treatment received from Dr Shailendra singh naik sir, thanks to Dr indu also best radiology team thanks to all",
    "I’ve taken my mother for her access port removal surgery with hundreds of questions in mind which were answered not in words but by putting into actions not just by the Surgeon, Dr. Praveen K Reddy but also each and every staff member. …",
    "Dr. Harshashree treated us very well. 4th ipd nursing staff service is good.",
    "Dr. Ramakrishna treatment is great. 5th ipd nursing staff service is very good. Overall experience is satisfactory.",
    "My father had spine fixation surgery here. We had absolutely worst experience ever. After surgery he was coughing blood, vomiting. They failed to detect there was a blood clot developed because of surgery at that time. The clot travelled to …",
    "Was admitted for high fever and infection for 2 days under dr. Shilpa and had a good recovery . Was treated in the 2nd floor individual ward.",
    "I was addmited in 6th floor economy under Dr.kausik rao ,ge treated very well, Satisfied with nursing team also\nThankyou",
    "We recently underwent urological surgery performed by Dr. Banu Teja Reddy, and I cannot praise his expertise and care enough. From start to finish, the experience was outstanding! …",
    "Worst experience with this hospital. It's only money minded. As soon as they see there is no more scope of money to fill their pockets,they abruptly leave the patient to his/her fate. There is no proper communication and transparency to the …",
    "Dear sir/mam,\n\nYour feedback is important to us! We wish to connect with you to understand more … More",
    "Very good experience with Dr.Ajay Reddy,I was admitted in 6th floor economy, Nursing,houskeeping is very good\nThank you",
    "I would have given negative rating if allowed…. One of the worst hospital….no doctors are available….BP machines don’t work….reception has no attendant to guide patients…the supervisor incharge was just roaming arnd ignorant of all this …",
    "Dr.Madhusudan treatment is very good. Nursing staff 6th economy is nice. F and b team service is nice.",
    "My self Vineela got admitted under Dr RaviKiran gastroenterologist at 6th floor premium economy,i would like to write this review as am happy and satisfied with all services of Nursing & housekeeping staff aas well maintained good hygiene,Am thankful to doctors and entire staff.",
    "Good afternoon all. Im admitted in 3rd ipd in 302b . Its really good experience.  All staff 3rd ipd its really very good and humble, they treated very well especially sis. Raji, kalyani, sushma. PRE neelesh, Duty doctor Linu. Thanks once again",
    "Dr. Ashok Kumar Singh treatment is super. 4th ipd nursing and house keeping staff service is very good. Will recommend this hospital.",
    "I consulted Dr Raghuram for my gastic ulcer issues. I am very happy with the way doctor diognosted, treated  and explained me the issue. I am also happy with the behavior of the nursing and other support staff. I recommend.",
    "@Dr. Randhir\nHe is finest doctor in continental hospital for neuro purpose.",
    "This review based on 2nd day experience. Everybody's behaviour is good on 1st day because you are new registered patient. 2nd day is the actual part. (Note: 2nd day is the report showing part and here you don't need to pay.) I visited …",
    "Really Good hospitality in Hyderabad we are admitted under  Dr Nalini in 3Rd Ipd 304B, very will nursing staff and Duty doctors and very supportive floor manager Mr Nilesh And staff jisni Kalyani Mounika well taking care Thanks to all Continent hospital",
    "It's amazing experience i got from continental hospital doctors and staff my mother got admitted in continental hospital in 3rd ipd everything is perfect everything settled very well the floor staff are good and flore manager also good nursing services excellent thanks to all",
    "Had multiple bad experiences with the billing in this Hospital. I have been to emergency room today when daughter fell down and got a head injury as well as leg and hip pain. The doctors took x-ray for the leg but couldn’t figure out …",
    "Overall service and hospitality very good\nDr Elizabeth Mandela mam\nCaring towards patient was fantastic …",
    "Been here for getting  knee surgery for my dad. Had Consultation with Orthopedic Doctor on appointment. …",
    "Very happy with services of continental hospital and Dr.Srinivas Aditya sir also guided us and the other duty doctors and nurses helped in every aspect and floor coordinator .",
    "Good experience with all nursing staffs. Very good doctors and professional setup for any kind of diseases treatment. Little expensive !!!",
    "Very good service and treatment, specially 4th and 5th IPD nursing staff and housekeeping team.",
    "Absulte excellent service from the dr side and sister we admitted under dr Vinith sir in 3rd ipd overal excellent treatment from the 3rd floor Nursing staffs & floor manager as well and sister kalyani helped alot very very best hospital in Hyderabad thanks to all ech and everyone",
    "Mr. Ravi really good person he come and check my body and documents and service is also good. Great service by 4th ipd nursing staff and House keeping staff.",
    "Dr Ashok kumar singh ENT surgeon and his team and entities continental hospital 5th IPD nursing staff was excellent during my surgery …",
    "My mother was consulted Dr.chakradar reddy n Dr dushyant n Dr Nalini mam excellent experience thanks",
    "I am working as a nurse in ESI hospital. I had a fall at home and got fracture to my hand. Visitied Dr.ARUN REDDY SIR in continental hospitals, he has explained well about the surgery, which is DISTAL RADIUS FRACTUTE.had very good treatment …",
    "Dr. Shravanthi Reddy treatment is very good. Great hospitality provided by 4th ipd nursing and house keeping staff.",
    "Dr. Dushyanth G treatment is very good. 4th ipd nursing staff service is good. Overall a good experience.",
    "We visited the continental hospital yesterday for some issue of my father. The staff was friendly and the treatment undertaken by the Dr. Satish Reddy he is really good that what we expected",
    "It was a great experience at Continental. Dr. Dushyant G. (ENT specialist) has been extremely hand-holding during the entire procedure. highly recommended.",
    "The doctors are being good.and treatment wise they have a good knowledge .\nsecurity ..radiology department, remaining staff doing very responsible. …",
    "Visited Dr Ganesh Gorti (Gastroenterology) for treatment for my father who is 87yrs old. Very much satisfied with the diagnosis and proposed treatment.",
    "Dr. Banu Teja Reddy treatment is good. 5th ipd nursing staff is good service and cooperative. Food also good quality.",
    "Treating under S. K Gupta, had good experience with doctor as well as services of the hospitals, health check too",
    "2 hours WASTED!! Had an appalling experience today at Continental Hospital. We had an appointment on 4th Jan  at 5:30 pm with Dr Sanjeeva Rao, Vascular Surgeon. The hospital called & our appointment was advanced to 5 pm. I planned my work …",
    "Operations of the hospital have a lot of room for improvement. The wait times were very high. e.g. it took us 30 minutes just to get from B4 to the 3rd floor, due to lack of lifts. Wait times for the X-Ray and NCS tests were 1 hr each. In short, a very exhausting experience.",
    "The worst hospital one can ever say. They say they have six drs upstairs and when we went up all the six drs were busy in surgery. What kind of hospital and management is it? Even after that i sat for 45mins where still they were unable to provide service. If you do not have drs available dunnot appoint patients.",
    "Treatment of my son was done at Continental Hospitals, Hyderabad.\nDoctors and facilities are of very high standards, to help my sons recovery.",
    "Excellent service, Doctor  are good, hospital is neat and clean.  The doctors visit regularly and they take care of all the things. Service staff are good.",
    "Dr.krishna mohan is the best cardiologist   and he gives good treatment.....fully satisfied with his treatment",
    "Came for Healthcheck from Hyatt, it was a good experience with this hospital, got a good service from the staffs, they guided well",
    "Dr.Harshashree treatment is great. 4th ipd nursing staff service is good.",
    "Overall a smooth experience with the doctor and staff, all are highly knowledgeable and experienced. Sister Sravanthi was very helpful and readily available. Will recommmed everyone. Hassle free discharge experience too.",
    "Dear sir/mam,\nWe are so glad to take care of you and your feedback will be shared with our staff and will truly bring millions smiles on their faces.  … More",
    "Dr. Raghuram kondala treatment is very nice. Good service by 4th ipd nursing staff. All good. Would recommend this hospital to everyone.",
    "My father consulted here to dr sandeep sir iam happy with his service n all staff nurse staff is also very polite highly recommend this hospital thanks",
    "Came for corporate annual checkup.\nGot proper direction.\nStaff is very helpful and direct us exactly to save time.",
    "my mother admitted in continental hospital under Dr Sathish Reddy sir it's really wonderfull hospital in Hyderabad excellant service we received and we are very happy with drs and sister and Floor manager Mr neelesh helped very well thanks to all continental staff and Dr Sathish sir ......",
    "It's unbelievable service from the Doctors side and nursing staff excellent staff at 3rd ipd all are very corporative especially thanks to Dr Rizwan sir and mr Nilesh and all sister thanks to all",
    "Great service provided by Nursing staff and Duty doctors and Housekeeping and floor incharge it's really we are very to use continental services each and everything settled verywell from ground level to higher good infrastructure and neat hospital we admitted in 3rd ipd thanks to all each and everyone",
    "The service of the Dr and staff is good Dr mukeem sir treatment is good me and my wife admitted In continental hospital under Dr Mukeem sir in 3rd ipd\ngood treatment we received one of the best hospitals entire in Hyderabad thanks to all",
    "I got admitted in the continental hospital.in 3ipd we felt satisfied\nMy father fully  recovered  with grace of doctors ,nursing staff and management. ...thank you  specially  3rdipd team",
    "All the services were good and up to mark.\nThanks to Dr. Ramesh for the speedy recovery.\nSpecial Thanks to sister Tanusha for her all time support and gentle care.",
    "Surgery Done.. By Dr. Arun reddy mallu all  the services are good. Nursing sisters... At 𝐄𝐜𝐨𝐧𝐨𝐦𝐲  𝐕𝐈𝐒𝐇𝐖𝐀 𝐑𝐀𝐍𝐈 , 𝐒𝐀𝐍𝐃𝐇𝐘𝐀 𝐋𝐀𝐕𝐀𝐍𝐘𝐀 𝐖𝐚𝐬 𝐞𝐱𝐥𝐥𝐞𝐜𝐞𝐧𝐭..... …",
    "Dr.Praveen dadireddy treatment is good  5th ipd nursing staff service is good. Overall experience is satisfactory.",
    "One of the dumbest&over hyped hospital I never seen,there main target is to loot the people in every aspects,if u have enough money then join in this hospital and go with empty hands😂, treatment is good 👍 but the process of giving is very …",
    "I am here to express my sincere thanks to all staff , nursing team at 6th floor economy and particularly Dr Abhishek mohanthy provided utmost care , answered to all my doubts very much patience, Excellent services.",
    "Treatment and careness very good in this hospital.Anusha reddy madam sravanthi reddy the both doctors treated well to us  and nurses services also very good in 4th ipd",
    "Very good infrastructure. Friendly staff and Doctors. Good care for Pre and post treatment",
    "This is to convey my heartiest thanks and gratitude towards the medical staff at Continental Hospital.\nTo start with...I would like to appreciate Dr.Harshashree for her patience and …",
    "My husband was admitted under Dr satish Reddy in 2and floor he is very good\nEveryone helps alot.",
    "Really excellent treatment from Continental doctors and sister my Father admittrd in 3rd ipd under Dr kranthi Kumar sir They way treatment and process and sisters are heped a lot  Thanks to duty doctors and sister And Floor manager garu your supported very well Thanks to all continental hospital management...",
    "Visited corporate health checkup, overall is very good experience, no heardles executives are very cooperative and guided nicely to complete the tests in order one by one, also last but not least the breakfast provided is very nice",
    "The experience is good in continental hospital - the coordination is excellent and I would prefer if some is looking for health check",
    "Treating under Dr.Ashok (Ent) had good experience with treatment and doctor as well staff. Received good services from continental hospital.",
    "I came here due to constipation and met Dr dheeraj gopal agarwal. He is very good in treatment and give proper treatment and test. Generally treatment was very good.",
    "It was good throughout, i was admitted in ER and later had minor surgery. Overall the process was smooth and the ward rooms were comfortable and clean.",
    "Good service from Dr Sunil E sir iam happy with his service highly recommend this hospital thanks",
    "I admitted under Dr Jagadeesh sir in continental hospital the entire from starting admission process to discharge everything is cool and I stayied in 3rd ipd room no:301 good staff ecch and everyone thinks to all sisters and doctors and  one and all whos supported us",
    "Thanks treatment all services are good nd well process sir.. very good approach.6th floor economy ward...",
    "Lab technician Naresh was very friendly, active and talented! He drew blood very easily where many other technicians had a trouble collecting the blood sample.",
    "Dr.Avs Suresh is good communication with me and friendly also ..\nGood guidance for health and hospitality is better thank you cooperation",
    "Very unorganised hospital…. Gives appointments arbitrarily even if the doctor is unavailable…. Appointment time is just a formality…. Attitude of people here is very casual and unprofessional…. Though one of the costliest hospital in the …",
    "Dr Chakradhar Reddy  sir is done surgery  Left shoulder Rotatory cuff repair and I'm doing well\nI'm referring to others and He is good Orthopaedic surgeon",
    "I went there for health checkup and this  is a nice and comfortable experience with this hospital",
    "The hospital is exuberant and huge like any other corporate hospital. Ambience is alluring. Ample parking space and paid valet is available charging 50 bucks per 3 hours. …",
    "We have received good treatment and good care was taken. We really appreciate all the staff members and the service provided.",
    "I had a good experience here. I had orthopedic and surgical requirements, and the processes were dealt quite smoothly. I would like to mention Dr. Satish Reddy who carefully handled my abcess surgery and post operative care. I would recommend this place for patients and families living nearby.",
    "Dr. A. Ajay Reddy Neurosurgeon Is A Great Doctor, Happy With The Hospital Service & Treatment Except About the Food (Outside food not allowed and too costly in hospital)",
    "Thought one of the best hospital in Hyderabad… but not at its standards",
    "I'm Satyanarayana patient of Dr.Yousef Ali I visited continental hospital 2 years ago with high sugars he treatment is excellent and caring and very good Doctor in twin cities his Assistant Dr.Frankley is very helpful in his work and available 24/7 Thanks a lot for the treatment and caring providing by continental hospitals",
    "\"I am incredibly grateful for the exceptional care my mother-in-law received at Continental Hospital during her recent surgery with Dr. Praveen Dadireddy. The professionalism, expertise, and compassion shown by Dr. Dadireddy and the …",
    "Dr. Goutham sir is very good,I was admitted in 2nd floor ipd, nursing is also good\nThankyou",
    "I met Dr.Dhananjaya KL , Nephrologist at  continental hospitals for kidney related issues for my uncle and sir  took enough time to explain me regarding the problem in detail and with complete patience  and the staff was also so good in …",
    "Dear continental Hospital Family.\nI really appreicate to all the staff of Continental Hospital in India, Hydrabad. …",
    "Great care at this hospital . Nice and caring nursing staff they were very patient ,there were many  modern facilities and doctors explained about the treatment really well . this hospital is a really good place for medical care",
    "We came for radiation treatment near\ndr mallik singaraju sir, prabhavathy madam and his team they treated very well as family members got very good experience with all",
    "I would like to give a detailed review about my experience with this hospital :\n\nFirst the disadvantages : …",
    "I recently met with an accident and needed a surgery which was performed by Dr. Gowtham. His hospitality is quite good and am hoping to recover soon under his guidance.",
    "Came for mom mri 2 days back.We r from other state. No appointment was taken. The radiology staff at reception taken in very less time. Ananaya was very helpful. Dr Varadha helped to take soon. Gave discount as well as mom senior citizen. Over all good services from continental 👍 …",
    "Dear sir/mam,\nWe are so glad to take care of you and your feedback will be shared with our staff and will truly bring millions smiles on their faces.  … More",
    "Consulted Dr.Kiran Kumar MD paediatrician for my 8 months old kid...Very well experienced and he also explained everything about treatment and he took good care of my child..",
    "Overall facilities provided by the organization was beyond the expectation.Outstanding behavior from all the staffs .Great support and treatment from the doctors and other staff.",
    "I was admitted in3rd ipd under Dr Rahul sir it was good experience with Dr Rahul and 3rd ipd sisters really i feel very happy with the hospital services very clean and cool hospital thanks to all staff who supported to me and thanks to Dr rahul sir floor manager Mr neelesh and sister raji and jisni i defiantly recommended this hospital",
    "I was admitted under Dr C V N Murthy in 3rd IPD\nSir was very good, dealt with my complaints patiently, and very cooperative also …",
    "I was admitted in 2nd floor under Dr.Varun sir,he treated very well\nThank you sir & nursing staffs also",
    "All the staff in this hospital are very good, their service is very fast, most importantly they respect the patients coming from abroad. Listen seriously. Help as much as possible if necessary. I will also tell others if you need to visit once you will get peace of mind and good treatment too. Greetings to you.",
    "Dear sir/mam,\nEncouragement and compliments will inspire us to be better healthcare providers and live up to our mission.   … More",
    "My name is boda prathip kumar\nI have gone right hemacolty surgery by the doctors kaushik rao surgical oncology …",
    "Health check....Thanks for your \"Hospitality\" ...I am extremely satisfied the way entire check up has gone through. Delighted by the care and giluidance time to time.. please keep it up.",
    "All over Hyderabad hospitals not matched with Continental hospital\nBecause i observed from last 6years\nVery good treatment …",
    "We thank you for your valuable feedback and appreciation for our hospital. At the heart of our services are patient health and utmost care. Your words motivate us to strive harder and excel in our clinical outcomes. Wishing you a very happy … More",
    "Admitted in 4th floor under Dr.Ravi Kiran sir ,got a good service from doctor & staffs too",
    "I consulted Dr Sathish Reddy(general surgeon)In OPD he suggested surgery for my personal problem finally I admited in3rd OPD from starting to ending my admission evrything is excellent best Service received from the 3rd OPD sisters and duty …",
    "Good service provided by 6th ecomomy nursing and House keeping staff. Food quality is good. Dr.Abhishek treatment is very good.",
    "Worst hospital in city staff are rude they don't want patient to discharge.Even cash discharge process takes  6-7hrs. Financial councillor will pressurize attendant to clear outstanding otherwise they won't give clearance for further  & stop treatment.",
    "One of the most pathetic OPD services they are providing. Even though they ask you to take appointment still wait time is 1 hour and for ultrasound we are here from 12..30 pm and till 2.30 pm they are just ask to wait for 15-20 mins and …",
    "- Your feedback is important to us! We wish to connect with you to understand more in detail about this incidence. We are unable to find your details in our system; kindly share your contact number, CHID at feedback@continentalhospitals.com … More",
    "4th ipd nursing staff service is good. Dr. Arun Reddy treatment is very good. Will recommend this hospital.",
    "I have taken my wife in pregnancy case and consulted Dr Suneetha kumari gynaecologist, continental hospital, we have done all our scans and tests in the same hospital itself and shown to Dr when ever she required to see the tests, and we …",
    "Worst hospital worst service worst people at reception it should be banned , None of them could help, We came for CT scan for a small kid and they made us wait for 4 hours with IV and fasting for my small kid and after all this they said CT …",
    "Good treatment provided by Dr.Lalatendu , Dr. Shravanthi Reddy, Dr.Kiran Kumar.G. Nursing staff and house keeping service is good.",
    "More than excellent hospital in Hyderabad the service of the 3rd ipd staff for save life it's super and very good doctors and staff Dr kranthi sir helped a lot thanks toall",
    "Dr.Ramakrishnudu treatment is very good. 6th economy nursing and House keeping staff services are good.",
    "Visited continental hospital for a surgery and treated by doctor chakradhar reddy. Surgery went well and very happy for the services offered by  the hospital. Chakradhar sir treated very well and he explained all the doubts clearly and his …",
    "Dr. Rizwan Ahmed treatment is very good. Great service provided by 5th ipd nursing staff.",
    "i took my son for stomach pain , they written thyroid test and  other tests which are not related to stomach pain .\nthey are doing unnecessary laboratory tests make more billings. …",
    "Dear sir/mam,\n\nYour feedback is important to us! We wish to connect with you to understand more … More",
    "one of the best hospital in hyderabad my mother admitted under dr Nishant sir nice experiance dr 3rd ipd sisters service is good and thanks to all doctors and sister and Neelesh   thankyou for your support .",
    "My father has admitted in this hospital 2 times , in last 2 years , hospital staff is very good and responsivenes especially thanks for dr.rama Krishna A",
    "Despite having competent doctors, the hospital lacks transparency in its communication with patients (Felt Intentional). They withhold crucial information, such as the denial of insurance claims, until the day of discharge, causing …",
    "Good service from dr C V N murthiy sir he ఐస్ వెరీ good డాక్టర్all over nice experience",
    "My husband had blood clot in the Brain and was suffering from severe headaches, vertigo, weakness, and other side effects. We visited multiple hospitals in Hyderabad before coming to Continental Hospitals. …",
    "The staff and mangemt were good towards patient. Nursing team and doctors are great in treatment .in 5th ipd nursing staff is very good",
    "I have done the health check at Continental hospital. overall experience is great.",
    "If have to do any test recommend by doctor please go outside and you will get in half of the price campare to here. Two days back we have taken the TIFFA scan here they have charged 3200 outside diagnosis you will get in 2000rs.  Quadruple …",
    "Worst hospital, vegetarian lunch 170 rupees ..tea is 40 rupees. Outside food they won't allow.It can be called a business hub instead of a hospital. Dear CM revanth reddy must take action on such kind of hospitals. They call it a VIP …",
    "In terms of the surgeons and doctors initially there is no issue they have done a tremendous job and kept us well informed.\nTerrible experience has been faced after being shifted to the ICU. With a …",
    "My mother was operated under Dr.Sudhakar Reddy .Patience to doctor response was excellant. Would have been more happy if room was hygiene.I happened to see cockroaches roaming in the room , even after complaint there was no action. Also, …",
    "Was admitted here for ACL reconstruction surgery after my ACL tear while playing football under Dr. Gowtham Chowdary. Everything went fine. The nurses, staff were so helpful and the service provided was excellent. Post surgery care was …",
    "Me and wife came here for our first child delivery.\nDr Jyothi Kanakanala and their panel of doctors  were very professional in their approach. Our delivery experience was awesome. …",
    "I got knee injury in byke accident. Admitted in Continental hospital, Hyderabad. I was fortunate to be assigned to the orthopedic sergion, Dr. Gowtham chowdary. He explained the severity of th damage very clearly. The stage wise …",
    "Dear sir/mam,\nWe are so glad to take care of you and your feedback will be shared with our staff and will truly bring millions smiles on their faces.  … More",
    "Excellent services , doctors are the best and have to mention Dr Shilpa and Dr Ramesh who really did the best to save my mom. Thanks to all the nurses in icu and doctors who really took care of mom in all aspects.",
    "We went for Dr.sravanthi reddy she is very good consultant for pediatric thank you mam",
    "The experience was really amazing and Dr.Swapna kunduru is very kind and generous with her patients, the whole process of registration through to consultation was smooth. I really recommend this hospital.",
    "Don't ever go to this hospital. They won't let you leave the hospital. You are bakraa for them. They will loot you like anything in the name of insurance. I went for normal stomach pain and was kept on a number of medications for 2 days …",
    "Dr.Abhishek and Dr.Raghuram treatment is very good. 5th IPD nursing staff service is very good. Would recommend this hospital.",
    "Dr. Chakradhar Reddy is very good Orthopedic. We are happy with the treatment.",
    "Surgery done under Dr.Amar Raghu sir.. all the services are good ..nursing sister @ 8th floor Deepa dubey..was fantastic.... Dressing...For me.. TQ.. 1s again... Deepa dubey..!",
    "The worst hospital I have erver visited I have taken my mum to the dermatologist for skin and hair concern the doctor we have visited have seen us given medication and a spray which are very expensive still we bought it... …",
    "The nursing staff and the nursing supervisor from 2nd IPD were very helpful. Special mention to nurse Bhanu, Shravanthi and Laxmi. great job.",
    "I got really best service from the dr Sowmya maam in 3rd ipd each and every staff given best service sisters and doctors all are best floor manager supported very well thanks to all",
    "Hospital services neatness are excellent and Doctors nurses everything is outstanding. Very good Hospital I ever found in Hyd.",
    "Good experience Dr satish sir in 6th floor ipd, got good service from the floor",
    "Came for health check in this hospital, it was a great experience with the service receive from the health check team\nThanks",
    "Experience at continental hospital with gynecologist dr.suneetha kumari.p\nI was visited the hospital and it was pregnency miscarriage issue.consulation was fine by the doctor.best doctor I was liked",
    "My father met with an accident immediately we rushed to emergency Dr GK sudhakar Reddy seen us . Diagnosed RIGHT PROXIMAL TIBIA FRACTURE WITH EXTERNAL FIXATOR IN SITU,2MONTHS POST INFECTED TYPE 3B RIGHT PROXIMAL TIBIA FRACTURE. …",
    "Dr sundeep, dr Nalini, Dr, Harika, Dr Shilpa  and full nurse staff and team all very concerned doctors and took good care of my mother.",
    "The nurses did not remove the iv needle during discharge and sent her home with the needle.  Very poor service from the hospital , I am really disappointed. Even the icu nurses were  very negligent.  My grandmother was put in upside down on the bed and her head was hanging,  no one checked until i came.",
    "My initial rating or experience was good . I didn’t experience parking issue that time as I came with driver. But if we come by self , parking facility is very poorly managed . …",
    "We thank you for your valuable feedback and appreciation for our hospital and Mr. Praveen. At the heart of our services are patient health and utmost care. Your words motivate us to strive harder and excel in our clinical outcomes. Wishing … More",
    "The most incompetent emergency unit I have ever seen. Went for sports injury on finger, 2 X-rays on same finger costs ₹400 and ₹900. Doesn’t make any sense. They did not give nor prescribe finger cot support or splint rather just applied a …",
    "The hospital is so bad that it cannot be summarised in words and even if there was an option of zero or negative rating, will have opted for the same. Everything in the hospital incl. Doctor, Admission staff and billing team is only out …",
    "Good doctor and staff Dr dhiraj sir was soo good and I got best treatment in this and nurse are also good iam happy with my treatment",
    "I have completed my synus surgery and tonsils ... Under Dr. Dushyanth ..I really had a great experience and very quick recovery under him. His so kind hearted person in his profession. His so experienced and very professional.\nOverall excellent hospitality. I'm really very much happy from all aspects.",
    "Over all treatment is good. Nursing staff is very polite and caring. Doctors are available on time. Only improvement is the billing manager. We expect more polite and humble responce from billing manager of such esteemed hospital.",
    "Good service from dr madhusudn sir Higley recommended this hospital",
    "Best diagnosis and treatment given by Dr. Yousuf Ali sir. Came with hy grade fever, Identified as typhoid after couple of tests. It was good treatment overall.",
    "Great service has been provided by the 4th IPD nursing staff in the continental hospital. Special thanks to Dr. Elizabeth.",
    "Avoid this hospital. Doctors are good but waiting time for tests like ultrascan, radiology is too much atleast for 2 hours. If you give importance to your time avoid this hospital.",
    "1. My appointments were canceled twice at the last moment, creating frustration and inconvenience. …",
    "Excellent care taking by the staff 3rd ipd\nExcellent dr ramakrishnudu sir sister are very good Mounik sister Raji sister very good Very  good co operative staff we are very happy with service thanks to all 3rd ipd staff each and everyone",
    "Every good experience in contential hospital.. special thanks to 3rd ipd staff sushma,Jyothi and dhanya and floor manger neelesh and Dr linu...thank u all",
    "Dr. Ranadheer Good doctor and taking care about patient and giving good information about patient and 6th economy nursing staff and house keeping also good han you",
    "Got my hernia surgery done here. Dr Ganesh was very helpful and took atmost care during pre & post surgery.",
    "I have under gone surgery for ACL RECONSTRUCTION by Dr. ARUN REDDY MALLU sir, great experience with Arun sir and hus explanation of surgery is very good. I recommend Dr. Arun Reddy sir for the orthopaedic problems. Thanks a lot sir.",
    "Service is very poor. No value of appointment. Try to avoid and go to other hospitals nearby. The reception and front staff are not sympathetic or kind towards patients. They treat the hospital like a business which is the worst way of care giving.",
    "I could have opted for negative ratting. I have an experience with 4 different departments that they make you make call 5 times to just book an appointment. Consulatation charges are very high and consultants work just to achieve targets …",
    "Better to avoid this hospital. Doctors are good but if you want to do Ultra scan or radiology then you have to wait for atleast 2 hours. Hospital staff is very irresponsible.. If you feel time is important then avoid the hospital.",
    "Dr. Praveen really treated and guided us well with the surgery, the 4th ipd nursing staff was really helpful",
    "highly unprofessional hospital, very money minded. Doctors are not at all sympathetic, they just care about the company you work in and charge you as much as they can. Hate it. Never going back there again.",
    "Treated under dr ashok kumar singh done with nose surgery had a good experience in Continental hospitals. Overall experienced with staff and dr was excellent. …",
    "Dr. Jagadeesh treatment is good. 4th ipd nursing staff is good. Overall good experience."
]